-- phpMyAdmin SQL Dump
-- version 4.7.2
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:8889
-- Время создания: Янв 15 2019 г., 23:04
-- Версия сервера: 5.6.35
-- Версия PHP: 7.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";

--
-- База данных: `WD04-filmoteka-Kozhan`
--

-- --------------------------------------------------------

--
-- Структура таблицы `films`
--

CREATE TABLE `films` (
  `id` int(11) NOT NULL,
  `name` text NOT NULL,
  `type` text NOT NULL,
  `year` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `films`
--

INSERT INTO `films` (`id`, `name`, `type`, `year`) VALUES
(1, 'Железный человек', 'Фантастика', 2008),
(2, '', '', 0),
(3, 'Мстители', '', 2012),
(4, 'Мстители', 'Фантастика', 2012),
(5, 'Мстители: Война бесконечности', 'Фантастика', 2018),
(6, 'Капитан америка', 'Фантастика', 2012),
(7, 'Стражи галактики 2', 'Фантастика', 2016),
(8, 'Стражи галактики 2', 'Фантастика', 2016),
(9, 'Стражи галактики 2', 'Фантастика', 2016),
(10, 'Стражи галактики 2', 'Фантастика', 2016),
(11, 'Стражи галактики 2', 'Фантастика', 2016),
(12, 'Стражи галактики 2', 'Фантастика', 2016),
(13, 'Стражи галактики 2', 'Фантастика', 2016);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `films`
--
ALTER TABLE `films`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `films`
--
ALTER TABLE `films`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;